[Killed] ConditionalExpression
src/analiseDeDados.js:7:11
     }
   
     adicionarDados(novosDados) {
-      if (!Array.isArray(novosDados)) throw new Error("Os dados devem ser um array.");
+      if (true) throw new Error("Os dados devem ser um array.");
       this.dados.push(...novosDados);
     }
killedBy: Classe AnaliseDeDados Depositar valores númericos para o array de dados
statusReason: Error: Os dados devem ser um array.

[Killed] ConditionalExpression
src/analiseDeDados.js:20:11
     }
   
     calcularMedia() {
-      if (this.dados.length === 0) return null;
+      if (true) return null;
       return this.dados.reduce((sum, num) => sum + num, 0) / this.dados.length;
     }
killedBy: Classe AnaliseDeDados Calcular a média dos valores do array fornecidos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3.8
Received: null

[Killed] ConditionalExpression
src/analiseDeDados.js:25:11
     }
   
     calcularMediana() {
-      if (this.dados.length === 0) return null;
+      if (true) return null;
       const ordenado = this.ordenarDados();
       const meio = Math.floor(ordenado.length / 2);
killedBy: Classe AnaliseDeDados Calcular a mediana dos valores do array fornecidos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2.5
Received: null

[Killed] LogicalOperator
src/analiseDeDados.js:34:22
     calcularModa() {
       if (this.dados.length === 0) return null;
       const frequencias = this.dados.reduce((freq, num) => {
-        freq[num] = (freq[num] || 0) + 1;
+        freq[num] = (freq[num] && 0) + 1;
         return freq;
       }, {});
killedBy: Classe AnaliseDeDados Calcular a moda dos valores disponíveis na listagem
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

- Array [
-   1,
-   2,

[Killed] EqualityOperator
src/analiseDeDados.js:40:24
   
       const maxFrequencia = Math.max(...Object.values(frequencias));
       return Object.keys(frequencias)
-        .filter(num => frequencias[num] === maxFrequencia)
+        .filter(num => frequencias[num] !== maxFrequencia)
         .map(Number);
     }
killedBy: Classe AnaliseDeDados Calcular a moda dos valores disponíveis na listagem
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

- Array [
-   1,
-   2,

[Killed] ConditionalExpression
src/analiseDeDados.js:45:11
     }
   
     calcularVariancia() {
-      if (this.dados.length === 0) return null;
+      if (true) return null;
       const media = this.calcularMedia();
       return this.dados.reduce((sum, num) => sum + Math.pow(num - media, 2), 0) / this.dados.length;
killedBy: Classe AnaliseDeDados Calcular a moda dos valores fornecidos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1.25
Received: null

[Killed] EqualityOperator
src/analiseDeDados.js:66:11
     normalizarDados() {
       const min = this.encontrarMinimo();
       const max = this.encontrarMaximo();
-      if (min === max) return this.dados.map(() => 0);
+      if (min !== max) return this.dados.map(() => 0);
       return this.dados.map(num => (num - min) / (max - min));
     }
killedBy: Classe AnaliseDeDados Normalizar dados fornecidos
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
    0,
-   0.5,

[Killed] EqualityOperator
src/analiseDeDados.js:71:55
     }
   
     calcularPercentil(percentil) {
-      if (this.dados.length === 0 || percentil < 0 || percentil > 100) return null;
+      if (this.dados.length === 0 || percentil < 0 || percentil <= 100) return null;
       const ordenado = this.ordenarDados();
       const index = (percentil / 100) * (ordenado.length - 1);
killedBy: Classe AnaliseDeDados Calculando o percentil dos dados com base na soma deles
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1.12
Received: null

[Killed] EqualityOperator
src/analiseDeDados.js:71:38
     }
   
     calcularPercentil(percentil) {
-      if (this.dados.length === 0 || percentil < 0 || percentil > 100) return null;
+      if (this.dados.length === 0 || percentil >= 0 || percentil > 100) return null;
       const ordenado = this.ordenarDados();
       const index = (percentil / 100) * (ordenado.length - 1);
killedBy: Classe AnaliseDeDados Calculando o percentil dos dados com base na soma deles
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1.12
Received: null

[Killed] ConditionalExpression
src/analiseDeDados.js:94:14
     calcularCoeficienteVariacao() {
       const media = this.calcularMedia();
       const desvio = this.calcularDesvioPadrao();
-      return media !== 0 ? (desvio / media) * 100 : null;
+      return false ? (desvio / media) * 100 : null;
     }
   
killedBy: Classe AnaliseDeDados Calculando Coeficiente Variacao (40,82....)
statusReason: Error: expect(received).toBeLessThan(expected)

Matcher error: received value must be a number or bigint

Received has value: null

[Killed] EqualityOperator
src/analiseDeDados.js:103:70
       const iqr = q3 - q1;
       const limiteInferior = q1 - fator * iqr;
       const limiteSuperior = q3 + fator * iqr;
-      this.dados = this.dados.filter(num => num >= limiteInferior && num <= limiteSuperior);
+      this.dados = this.dados.filter(num => num >= limiteInferior && num > limiteSuperior);
     }
   
killedBy: Classe AnaliseDeDados Removendo outliers(tendo como fator 2)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 0

[Killed] ArrowFunction
src/analiseDeDados.js:112:43
       const mediaX = this.calcularMedia();
       const mediaY = outroConjunto.reduce((sum, num) => sum + num, 0) / outroConjunto.length;
   
-      const numerador = this.dados.reduce((sum, x, i) => sum + (x - mediaX) * (outroConjunto[i] - mediaY), 0);
+      const numerador = this.dados.reduce(() => undefined, 0);
       const denominadorX = Math.sqrt(this.dados.reduce((sum, x) => sum + Math.pow(x - mediaX, 2), 0));
       const denominadorY = Math.sqrt(outroConjunto.reduce((sum, y) => sum + Math.pow(y - mediaY, 2), 0));
killedBy: Classe AnaliseDeDados Calculando correlação dos valores(0,999999...)
statusReason: Error: expect(received).toBeLessThanOrEqual(expected)

Expected: <= 1
Received:    NaN

[Killed] ArithmeticOperator
src/analiseDeDados.js:113:68
       const mediaY = outroConjunto.reduce((sum, num) => sum + num, 0) / outroConjunto.length;
   
       const numerador = this.dados.reduce((sum, x, i) => sum + (x - mediaX) * (outroConjunto[i] - mediaY), 0);
-      const denominadorX = Math.sqrt(this.dados.reduce((sum, x) => sum + Math.pow(x - mediaX, 2), 0));
+      const denominadorX = Math.sqrt(this.dados.reduce((sum, x) => sum - Math.pow(x - mediaX, 2), 0));
       const denominadorY = Math.sqrt(outroConjunto.reduce((sum, y) => sum + Math.pow(y - mediaY, 2), 0));
   
killedBy: Classe AnaliseDeDados Calculando correlação dos valores(0,999999...)
statusReason: Error: expect(received).toBeLessThanOrEqual(expected)

Expected: <= 1
Received:    NaN

[Killed] ConditionalExpression
src/analiseDeDados.js:116:14
       const denominadorX = Math.sqrt(this.dados.reduce((sum, x) => sum + Math.pow(x - mediaX, 2), 0));
       const denominadorY = Math.sqrt(outroConjunto.reduce((sum, y) => sum + Math.pow(y - mediaY, 2), 0));
   
-      return denominadorX * denominadorY !== 0 ? numerador / (denominadorX * denominadorY) : null;
+      return false ? numerador / (denominadorX * denominadorY) : null;
     }
   }
killedBy: Classe AnaliseDeDados Calculando correlação dos valores(0,999999...)
statusReason: Error: expect(received).toBeLessThanOrEqual(expected)

Matcher error: received value must be a number or bigint

Received has value: null
